app/controllers/school_classes_controller.rb

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "school_classes" WHERE "school_classes"."id" = ?  [["id", 4]]
---
    def destroy
        @school_class = SchoolClass.find(params[:id])
        @school_class.destroy